## API-1 Machine Learning

# Analizar la información sobre pasajeros del Titanic

In [21]:
# Importar las librerias necesarias para el análisis
# Importar Pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Armo el Data Frame con los datos del data set y muestro las primeras 5 filas

In [22]:
# Armando el data frame  
data = pd.read_csv('titanic.csv', sep=';')
# Muestro las primeras 5 filas
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,2.113.375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,1.515.500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,1.515.500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,1.515.500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,1.515.500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Verifico si hay datos faltantes en el data set

In [23]:
# Usando la funcion isna() junto con sum() para contar los valores faltantes en cada columna
data.isna().sum()

pclass         76
survived        0
name            0
sex             0
age           239
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

## Reemplazo en la columna pclass todas las filas que estan en Nan con 2

In [24]:
# Reemplazo las filas vacias en pclass con 2.0
data['pclass'].fillna(2, inplace=True)

# verifico los cambios
data.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           239
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

## Reviso y estadarizo los valores de la variable Sex, deben quedar "Male" y "Female"

In [ ]:
# Reemplazar las filas de la columna 'sex' que contengan 'Hombre' por 'male' y 'Mujer' por 'female
# Reemplazo Hombre por male
data['sex']=data['sex'].replace('Hombre', 'male')
# Reemplazo Mujer por female
data['sex']=data['sex'].replace('Mujer', 'female')

# verifico los cambios
data.isna().sum()

pclass          0
survived        0
name            0
sex          1219
age           239
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

## Calcular el promedio de edad para reemplazar a los que estan en NaN

In [6]:
# Reemplazo los datos de edad en NaN por el promedio
mean_age = data['age'].mean()
data['age'].fillna(mean_age, inplace=True)

# Verifico si hay datos faltantes en el data set
data.isna().sum()

pclass          0
survived        0
name            0
sex           437
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        2
boat          751
body         1110
home.dest     475
dtype: int64

## Acá se debe agregar una 'S' en la variable embarked cuando tenga NaN

In [15]:
# Agreo 'S' en las variables embarcadas que esten en NaN
data['embarked'].fillna('S', inplace=True)

# Verifico si hay datos faltantes en el data set
data.isna().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin         927
embarked        0
boat          751
body         1110
home.dest     475
dtype: int64

In [20]:
# Exportar a CSV (más común)
data.to_csv('titanic_preprocesado.csv', index=False)

# Con configuración específica
data.to_csv('titanic_preprocesado.csv', 
          index=False, 
          encoding='utf-8',
          sep=',')

print("✅ Archivo CSV exportado: 'titanic_preprocesado.csv'")

✅ Archivo CSV exportado: 'titanic_preprocesado.csv'